{
    "Housing":[
        {
            "img": "./Images/home.png",
            "text": "Housing Payment",
            "width": "50px",
            "desc": "Expenses related to housing payments, including rent or mortgage payments, property taxes, and homeowner's insurance."
        }
    ],
    "Transportation":[
        {
            "img": "./Images/transportation.png",
            "text": "Transportation Spending",
            "width": "50px",
            "desc": "Expenses related to transportation, such as fuel costs, public transit fares, vehicle maintenance, and parking fees."
        }
    ],
    "Food":[
        {
            "img": "./Images/food.png",
            "text": "Food Spending",
            "width": "50px",
            "desc": "Expenses related to food purchases, including groceries, dining out, and snacks."
        }
    ],
    "Healthcare":[
        {
            "img": "./Images/healthcare.png",
            "text": "Healthcare",
            "width": "50px",
            "desc": "Expenses related to healthcare, including health insurance premiums, medical bills, prescriptions, and co-pays."
        }
    ],
    "Utilities":[
        {
            "img": "./Images/utility.png",
            "text": "Utilities Payment",
            "width": "50px",
            "desc": "Expenses related to utility bills, including electricity, gas, water, internet, and phone services."
        }
    ],
    "Entertainment":[
        {
            "img": "./Images/entertainment.png",
            "text": "Entertainment Spending",
            "width": "50px",
            "desc": "Expenses related to entertainment, such as movie tickets, streaming subscriptions, concerts, and recreational activities."
        }
    ],
    "Clothing and Personal Care":[
        {
            "img": "./Images/clothing.png",
            "text": "Clothing and Personal Care",
            "width": "50px",
            "desc": "Expenses related to clothing purchases, shoes, accessories, as well as personal care items like toiletries, cosmetics, and haircuts."
        }
    ],
    "Debt Payments":[
        {
            "img": "./Images/debt.png",
            "text": "Debt Payment",
            "width": "50px",
            "desc": "Expenses related to debt repayment, including credit card payments, loan payments, and other outstanding debts."
        }
    ],
    "Savings and Investments":[
        {
            "img": "./Images/saving.png",
            "text": "Savings and Investments",
            "width": "50px",
            "desc": "Expenses related to savings contributions and investments, such as retirement savings, investment accounts, and contributions to savings goals."
        }
    ],
    "Education":[
        {
            "img": "./Images/education.png",
            "text": "Education",
            "width": "50px",
            "desc": "Expenses related to education, including tuition fees, textbooks, school supplies, and educational resources."
        }
    ],
    "Travel":[
        {
            "img": "./Images/travel.png",
            "text": "Travel",
            "width": "50px",
            "desc": "Expenses related to travel, such as airfare, hotel accommodations, transportation costs, and travel activities."
        }
    ],
    "Donations":[
        {
            "img": "./Images/donation.png",
            "text": "Donations",
            "width": "50px",
            "desc": "Expenses related to charitable donations and contributions to nonprofit organizations."
        }
    ],
    "Insurance":[
        {
            "img": "./Images/insurance.png",
            "text": "Insurance",
            "width": "50px",
            "desc": "Expenses related to insurance premiums, including health insurance, car insurance, home insurance, and other types of insurance coverage."
        }
    ],
    "Taxes":[
        {
            "img": "./Images/taxes.png",
            "text": "Taxes",
            "width": "50px",
            "desc": "Expenses related to taxes, including income taxes, property taxes, sales taxes, and other tax liabilities."
        }
    ],
    "Miscellaneous":[
        {
            "img": "./Images/miscellaneous.png",
            "text": "Miscellaneous",
            "width": "50px",
            "desc": "Expenses that do not fit into any specific category, including one-time purchases, unexpected expenses, and other miscellaneous costs."
        }
    ]
}
